export const settingsKey: string = 'simpleaccents.symbolsToReplace';

export const symbols: Array<[string, string]> =
[
	// Cyrillic
	[ "А", "А́" ],
	[ "а", "а́" ],
	[ "Е", "Е́" ],
	[ "е", "е́" ],
	[ "И", "И́" ],
	[ "и", "и́" ],
	[ "О", "О́" ],
	[ "о", "о́" ],
	[ "У", "У́" ],
	[ "у", "у́" ],
	[ "Ы", "Ы́" ],
	[ "ы", "ы́" ],
	[ "Э", "Э́" ],
	[ "э", "э́" ],
	[ "Ю", "Ю́" ],
	[ "ю", "ю́" ],
	[ "Я", "Я́" ],
	[ "я", "я́" ],

	// Latin
	[ "A", "Á" ],
	[ "a", "á" ],
	[ "E", "É" ],
	[ "e", "é" ],
	[ "I", "Í" ],
	[ "i", "í" ],
	[ "O", "Ó" ],
	[ "o", "ó" ],
	[ "U", "Ú" ],
	[ "u", "ú" ],
	[ "Y", "Ý" ],
	[ "y", "ý" ],

	// Special
	[ "-", "—" ],
	[ "\"", "«»" ]
];